#dict - словарь. упорадоченное колекция элементов
#с пайтона 3.7 сталл упарядочным .. Каждый элемен словаря хранится виде пары {ключ: значение }

#ассоциотивный массив и еще на англиском  hash. tables. object. structure == dictionaru

#ключами могут выступать только неизменяемые типы данных и в словаря хранится
# уникальные ключи . Тогда как значение могут быть любые данные..

########################################
# thisdict = {
#     'brand': 'Ford',
#     'model': 'Mustang',
#     'year': 1967
# }
# print(thisdict)
# print(type(thisdict))
# print(thisdict['model'])
# print(thisdict['year'])

###################################3

# a = dict()
# b = {}
# получем дикшинери но если {} c данными то получим масив set
############################
# ls = [('key1', 'value'), ('key2', 'value2')]
# dict_ = dict(ls)
# print(dict_)
#######################

#print(dir(dict))

