
# Типы данныйх в питона
    #1) NoneType  -Ничего, пустота
    # 2) Boolean - True/False
    # 3)str -это строки текстовая информация 'Hello World', 'My name is Jon'
    # 4)int - числовой (целое число)
    # 5)float - число с плавущей точкой (1,445)
    # 5)complex - комплексные числа (3+5i6)
# Списковые типы данных
    # list (список\массив) --(1,2,3,None, 'Hello' True, False)
    #tuple (кортеж) кортеж не изменяеся моссив
    # range (последовательность ) - range(1,10)
 # set-- Множества
 # dict(словари)-- содержит данные в виде ключа и значение -- {1: 'One', 2: 'Two'}
 # ***************************************************************************************
# Mutablt (изменяемые типы данных )
# 1)list
# 2)set
# 3)dict
# Immitable (неизменяемые типы данных)
# 1. None
# 2.boolean
# 3.int float complex
# 4. str
# 5.range
# 6. tuple
# 7. frozenset
# *****************************************************************************************
'''стандартный вывод данных в пайтоне для вывода данных используется команда print'''
# print('Hello world \n, my name is john snow \n I love')
# print('привет как дела')
# # стандартный вод данных функция input()
# a = input('ведите число')
# print('В а хранится', a)
# print(input('vedite imia'))
inp1=int(input())
inp2=int(input())
inp3=int(input())
print(inp1*inp2%inp3)
